# 以下都是相对雷电，模拟器的坐标位置


# 点击最外层开始游戏
play_game = {
    'x': 1350,
    'y': 600,
}
# 开始钓鱼,抛竿,提竿,点击钓鱼
start_fish = {
    'x': 1360,
    'y': 710
}
# 截取钓鱼进度条
cut_fish_pro = {
    'x': 485,
    'y': 60,
    'width': 640,
    'height': 50
}
# 再次钓鱼
again_fish = {
    'x': 1200,
    'y': 760,
}
# 截取判断是否还有饵料
cut_is_bait = {
    'x': 1025,
    'y': 675,
    'width': 175,
    'height': 150
}
# 截取判断是否满了
cut_is_full = {
    'x': 445,
    'y': 120,
    'width': 705,
    'height': 35
}
# 判断是否要超了的颜色坐标
get_man_color = {
    'x': 1044,
    'y': 90,
}
# 不超的标准颜色
norm_color = (101, 79, 66)
# 判断是否要超了的颜色坐标
get_pole_color = {
    'x': 1136,
    'y': 138,
}
# 不超的标准颜色
pole_color = (94, 80, 60)
# 倒计时图标坐标
countdown_tag = {
    'x': 271,
    'y': 98,
}
# 倒计时标准颜色
countdown_tag_color = (110, 80, 64)
# 测试风坐标
test_wind = {
    'x': 1308,
    'y': 517,
}
# 测试风应标准颜色
test_wind_color = (112, 82, 64)
# 上，左,下，右,风，火，雷，电分别点击坐标
up = {
    'x': 300,
    'y': 555,
}
left = {
    'x': 180,
    'y': 665,
}
un = {
    'x': 300,
    'y': 777,
}
right = {
    'x': 415,
    'y': 665,
}
wind = {
    'x': 1310,
    'y': 555,
}
fire = {
    'x': 1195,
    'y': 665,
}
ray = {
    'x': 1310,
    'y': 777,
}
electricity = {
    'x': 1425,
    'y': 665,
}
# 识别上方展示致命一击坐标
four_tag_x = [621, 741, 862, 982]
five_tag_x = [560, 680, 800, 920, 1040]
six_tag_x = [501, 621, 741, 862, 982, 1102]
all_tag_y = 175
# 关于判断是4个,5个,6个,其对应坐标
# 中心坐标,区分5
center_tag = {
    'x': 800,
    'y': 175,
}
center_color = (145, 159, 154)
# 区分4,6
four_six_tag = {
    'x': 1102,
    'y': 133,
}
four_six_color = (123, 116, 117)
